# Используйте официальный образ Go в качестве базового
FROM golang:1.22

# Установите текущую рабочую директорию внутри контейнера
WORKDIR /app

# Скопируйте файлы go.mod и go.sum
COPY go.mod go.sum ./

# Загрузите все зависимости. Зависимости будут кэшированы, если файлы go.mod и go.sum не изменятся
RUN go mod download

# Запустите go mod tidy для обновления файла go.mod
RUN go mod tidy  # Добавлено для обновления go.mod

# Скопируйте исходный код в контейнер
COPY . .

# Соберите приложение Go
RUN go build -o main .

# Откройте порт 8080 для внешнего мира
EXPOSE 8080

# Команда для запуска исполняемого файла
CMD ["./main"]